In [40]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [41]:
data = pd.read_csv('Amazon_Combined_Data.xlsx - Amazon_Data.csv')

In [42]:
data.head()

,Product Category,Product Description,Price(Dollar),Number of reviews,Shipment,Order Date
0,Audio Video,"Upgraded, Anker Soundcore Bluetooth Speaker wi...",27,"82,773",Ships to Bangladesh,1/3/2019
1,Audio Video,Twelve South AirFly Pro Bluetooth Wireless Aud...,54,"5,121",Ships to Bangladesh,1/4/2019
2,Audio Video,iOttie Easy One Touch 5 Dashboard & Windshield...,24,"126,957",Ships to Bangladesh,1/4/2019
3,Audio Video,"INIU Wireless Charger, 15W Fast Wireless Charg...",15,"18,837",Ships to Bangladesh,1/4/2019
4,Audio Video,JBL Flip 4 Waterproof Portable Bluetooth Speak...,78,"13,141",Ships to Bangladesh,1/5/2019

In [43]:
data.tail()

,Product Category,Product Description,Price(Dollar),Number of reviews,Shipment,Order Date
89077,Toys,Papo - Hand-Painted - Figurine - Marine Life -...,11,"1,094",Ships to Bangladesh,4/30/2022
89078,Toys,Green Toys Farm Playset. CB2,26,78,Ships to Bangladesh,4/30/2022
89079,Toys,"Teenage Mutant Ninja Turtles 5"" Sewer Shredder...",10,78,Ships to Bangladesh,4/30/2022
89080,Toys,"Schleich Wild Life, Wild Animal Toys for Kids,...",42,78,Ships to Bangladesh,4/30/2022
89081,Toys,"Schleich bayala, 5-Piece Starter Set with Fair...",34,78,Ships to Bangladesh,4/30/2022

In [44]:
data.columns

Index(['Product Category', 'Product Description', 'Price(Dollar)',
       'Number of  reviews', 'Shipment', 'Order Date'],
      dtype='object')

In [45]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89082 entries, 0 to 89081
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Product Category     89082 non-null  object
 1   Product Description  89082 non-null  object
 2   Price(Dollar)        89082 non-null  object
 3   Number of  reviews   89082 non-null  object
 4   Shipment             89082 non-null  object
 5   Order Date           89082 non-null  object
dtypes: object(6)
memory usage: 4.1+ MB

In [46]:
data.describe().T

,count,unique,top,freq
Product Category,89082,8,Men Shoes,23228
Product Description,89082,67942,KODAK Step Slim Instant Mobile Color Photo Pri...,429
Price(Dollar),89082,1332,49,2810
Number of reviews,89082,5102,1,5572
Shipment,89082,14,Ships to Bangladesh,88126
Order Date,89082,1243,9/5/2021,342

In [47]:
data.describe(include = "object")

,Product Category,Product Description,Price(Dollar),Number of reviews,Shipment,Order Date
count,89082,89082,89082,89082,89082,89082
unique,8,67942,1332,5102,14,1243
top,Men Shoes,KODAK Step Slim Instant Mobile Color Photo Pri...,49,1,Ships to Bangladesh,9/5/2021
freq,23228,429,2810,5572,88126,342

In [48]:
data.duplicated().sum()

135

In [49]:
data = data.drop_duplicates()

In [50]:
data.duplicated().sum()

0

In [51]:
data.isnull().sum()

Product Category       0
Product Description    0
Price(Dollar)          0
Number of  reviews     0
Shipment               0
Order Date             0
dtype: int64

In [55]:
data['Order Date'] = pd.to_datetime(data['Order Date'], errors='coerce')

data["Year"] = data["Order Date"].dt.year
data["Month"] = data["Order Date"].dt.month_name()
data["Quarter"] = data["Order Date"].dt.to_period("Q").astype(str)
data["Weekday"] = data["Order Date"].dt.day_name()

data[["Order Date", "Year", "Month", "Quarter", "Weekday"]].head()

  Order Date  Year    Month Quarter   Weekday
0 2019-01-03  2019  January  2019Q1  Thursday
1 2019-01-04  2019  January  2019Q1    Friday
2 2019-01-04  2019  January  2019Q1    Friday
3 2019-01-04  2019  January  2019Q1    Friday
4 2019-01-05  2019  January  2019Q1  Saturday

In [56]:
data.to_csv('amazon_sales_analysis.csv', index=False)